IDENTIFICATION DIVISION.
PROGRAM-ID. ABC001A.
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 H1  PIC S9(9).
  01 H2  PIC S9(9).
  01 OUT PIC Z(10).
PROCEDURE DIVISION.
MAIN.
  ACCEPT H1 FROM CONSOLE.
  ACCEPT H2 FROM CONSOLE.
  SUBTRACT H2 FROM H1 GIVING H1.
  IF H1 < 0 THEN
    DISPLAY "-" WITH NO ADVANCING
  ELSE
    IF H1 = 0  THEN
      DISPLAY "0" WITH NO ADVANCING
    END-IF
  END-IF.
  MOVE H1 TO OUT.
  DISPLAY FUNCTION TRIM(OUT).
  STOP RUN.
  
